#include "FilterScreen.h"

void FilterScreen::showMainMenu() {
    std::cout << "1. Управління співробітниками\n";
    std::cout << "2. Управління автомобілями\n";
    std::cout << "3. Управління продажами\n";
    std::cout << "4. Звіти\n";
    std::cout << "5. Зберегти дані у файл\n";
    std::cout << "6. Завантажити дані з файлу\n";
    std::cout << "0. Вихід\n";
}

void FilterScreen::showEmployeeMenu() {
    std::cout << "1. Додати співробітника\n";
    std::cout << "2. Видалити співробітника\n";
    std::cout << "0. Повернутися до головного меню\n";
}

void FilterScreen::showCarMenu() {
    std::cout << "1. Додати автомобіль\n";
    std::cout << "2. Видалити автомобіль\n";
    std::cout << "0. Повернутися до головного меню\n";
}

void FilterScreen::showSalesMenu() {
    std::cout << "1. Додати продаж\n";
    std::cout << "2. Видалити продаж\n";
    std::cout << "0. Повернутися до головного меню\n";
}

void FilterScreen::showReportsMenu() {
    std::cout << "1. Інформація про співробітників\n";
    std::cout << "2. Інформація про автомобілі\n";
    std::cout << "3. Інформація про продажі\n";
    std::cout << "4. Продажі за певну дату\n";
    std::cout << "5. Продажі за період часу\n";
    std::cout << "6. Продажі конкретного співробітника\n";
    std::cout << "7. Найбільш продаваний автомобіль за вказаний період\n";
    std::cout << "8. Інформація про найуспішнішого продавця за вказаний період\n";
    std::cout << "9. Загальний прибуток за вказаний період\n";
    std::cout << "0. Повернутися до головного меню\n";
}

